package com.siwuxie095.spring.boot.chapter8th.example1st;

/**
 * @author Jiajing Li
 * @date 2021-04-29 22:30:44
 */
public class Main {

    /**
     * 部署 Spring Boot 应用程序
     *
     * 想一想你喜欢的动作电影。现在假设你要去电影院看这部电影，享受视听震撼。片中有高速追逐、爆炸和激战。
     * 好人还没战胜坏人，一切偏偏戛然而止。还没等影片里的冲突解决，电影院的灯亮了，大家都被领出门外。
     *
     * 虽然前面的铺垫很精彩，但电影的高潮才是最重要的。没有了它，就是为了动作而动作了。
     *
     * 现在，想象你正在开发应用程序，为解决某个业务问题投入了很多精力和创造力，但最终没能部署应用程序，
     * 没能让别人使用这个程序并乐在其中。当然，应用程序里大多没有汽车追逐和爆炸，但一路上也是会争分夺秒。
     * 当然，并非每行代码都为生产环境而写，但什么都不部署也挺让人失望的。
     *
     * 目前为止，这里的焦点都集中在使用 Spring Boot 的特性帮助大家开发应用程序。其中遇到了不少惊喜。
     * 但如果不越过终点线，应用程序没有部署，这一切都是徒劳。
     *
     * 在这里，会在使用 Spring Boot 开发应用程序的基础上更进一步，讨论如何部署那些应用程序。虽然这对
     * 部署过基于 Java 的应用程序的人来说并无特别之处，但 Spring Boot 和相关的 Spring 项目中有些独
     * 特的功能，基于这些功能可以让 Spring Boot 应用程序的部署变得与众不同。
     *
     * 实际上，大部分 Java Web 应用程序都以 WAR 文件的形式部署到应用服务器上。Spring Boot 提供的部
     * 署方式则有所不同，后者在部署上提供了不少选择。在了解如何部署 Spring Boot 应用程序之前，先看看
     * 这些可选方式，找出能满足需求的那些选项。
     */
    public static void main(String[] args) {

    }

}
