package com.siwuxie095.spring.boot.chapter2nd.example1st;

/**
 * @author Jiajing Li
 * @date 2021-04-07 22:00:14
 */
public class Main {

    /**
     * 开发第一个应用程序
     *
     * 你上次在超市或大型零售商店自己推开门是什么时候？大多数大型商店都安装了带感应功能的自动门，虽然所有门
     * 都能让你进入建筑物内，但自动门不用你动手推拉。
     *
     * 与之类似，很多公共场所的卫生间里都装有自动感应水龙头和自动感应纸巾机。虽然没有超市自动门这么普及，但
     * 这些设施同样对你没有太多要求，可以很方便地出水和纸巾。
     *
     * 说实话，已经不记得上次看到制冰盒是什么时候了，更不记得自己往里面倒水制冰或者取冰的事了。冰箱就是这么
     * 神奇，总是有冰，让人随时都能喝上冰水。
     *
     * 你肯定也能想出无数例子，证明设备让现代生活更加自动化，而不是增加障碍。有了这些自动化的便利设施，你会
     * 认为在开发任务里也会出现更多的自动化。但是很奇怪，事实并非如此。
     *
     * 直到最近，要用 Spring 创建应用程序，你还需要为框架做很多事情。当然，Spring 提供了很多优秀的特性，
     * 用于开发令人惊讶的应用程序。但是，你需要自己往项目的构建说明文件里添加各种库依赖，还要自己写配置文件，
     * 告诉 Spring 要做什么。
     *
     * Spring Boot 将 Spring 开发的自动化程度提升到了一个新的高度，在这里会看到两种新方法：起步依赖和自
     * 动配置。在项目中启用 Spring 不仅枯燥乏味，还让人分神，你将看到这些基础的 Spring Boot 特性是如何
     * 将你解放出来，让你集中精力开发应用程序的。与此同时，你会写一个很小的 Spring 应用程序，麻雀虽小，五
     * 脏俱全，其中会用上 Spring Boot。
     */
    public static void main(String[] args) {

    }

}
