package com.siwuxie095.spring.boot.chapter3rd.example1st;

/**
 * @author Jiajing Li
 * @date 2021-04-12 08:02:30
 */
public class Main {

    /**
     * 自定义配置
     *
     * 能自由选择真是太棒了。如果你订过比萨就会知道，你完全可以掌控薄饼上放哪些辅料。选定腊肠、意大利辣香肠、青辣椒
     * 和额外芝士的时候，你就是在按照自己的要求配置比萨。
     *
     * 另一方面，大部分比萨店也提供某种形式的自动配置。你可以点荤比萨、素比萨、香辣意大利比萨，或者是自动配置比萨中
     * 的极品 —— 至尊比萨。在下单时，你并没有指定具体的辅料，你所点的比萨种类决定了所用的辅料。
     *
     * 但如果你想要至尊比萨上的全部辅料，还想要加墨西哥胡椒，又不想放蘑菇该怎么办？你偏爱辣食又不喜欢吃菌类，自动配
     * 置不适合你的口味，你就只能自己配置比萨了吗？当然不是，大部分比萨店会让你以菜单上已有的选项为基础进行定制。
     *
     * 使用传统 Spring 配置的过程，就如同订比萨的时候自己指定全部的辅料。你可以完全掌控 Spring 配置的内容，可是
     * 显式声明应用程序里全部的 Bean 并不是明智之举。而 Spring Boot 自动配置就像是从菜单上选一份特色比萨，让
     * Spring Boot 处理各种细节比自己声明上下文里全部的 Bean 要容易很多。
     *
     * 幸运的是，Spring Boot 自动配置非常灵活。就像比萨厨师可以不在你的比萨里放蘑菇，而是加墨西哥胡椒一样，
     * Spring Boot 能让你参与进来，影响自动配置的实施。
     *
     * 这里将看到两种影响自动配置的方式 —— 使用显式配置进行覆盖和使用属性进行精细化配置。还会看到如何使用 Spring
     * Boot 提供的钩子引入自定义的错误页。
     */
    public static void main(String[] args) {

    }

}
